package ru.top.practic.concurrent.practice3;

public class Main {

    //Задание 3
    //Пользователь с клавиатуры вводит путь к файлу,
    //содержащему набор чисел. После чего запускаются две
    //потока. Первый поток создает новый файл, в который
    //запишет только четные элементы массива. Второй поток
    //создает новый файл в который запишет только нечетные
    //элементы массива. Количество четных и нечетных элементов возвращается в метод main.
    public static void main(String[] args) {

    }
}
